import pandas as pd
import numpy as np


def main(fileName):
  BE = 543
  df = pd.read_excel(fileName)

  df = df.drop(columns=['ปี พ.ศ.', 'หมายเหตุ'])

  df.insert(1, "ชื่อกรม", "มหาวิทยาลัยขอนแก่น")
  df.insert(9, "รหัสตำแหน่ง", np.nan)
  df.insert(15, "บ.ม.", np.nan)
  df.insert(16, "บ.ช.", np.nan)
  df.insert(17, "จ.ม.", np.nan)
  df.insert(18, "จ.ช.", np.nan)

  for i in range(len(df['เครื่องราชอิสริยาภรณ์'])):
    if df['เครื่องราชอิสริยาภรณ์'][i] == 'มหาปรมาภรณ์ช้างเผือก':
      df['เครื่องราชอิสริยาภรณ์'][i] = "ม.ว.ม."
    elif df['เครื่องราชอิสริยาภรณ์'][i] == 'มหาวชิรมงกุฏไทย':
      df['เครื่องราชอิสริยาภรณ์'][i] = "ป.ช."
    elif df['เครื่องราชอิสริยาภรณ์'][i] == 'มหาวชิรมงกุฎ':
      df['เครื่องราชอิสริยาภรณ์'][i] = "ป.ช."
    elif df['เครื่องราชอิสริยาภรณ์'][i] == 'ประถมาภรณ์ช้างเผือก':
      df['เครื่องราชอิสริยาภรณ์'][i] = "ป.ม."
    elif df['เครื่องราชอิสริยาภรณ์'][i] == 'ประถมาภรณ์มงกุฏไทย':
      df['เครื่องราชอิสริยาภรณ์'][i] = "ท.ช."
    elif df['เครื่องราชอิสริยาภรณ์'][i] == 'ทวีติยาภรณ์ช้างเผือก':
      df['เครื่องราชอิสริยาภรณ์'][i] = "ท.ม."
    elif df['เครื่องราชอิสริยาภรณ์'][i] == 'ทวีติยาภรณ์มงกุฎไทย':
      df['เครื่องราชอิสริยาภรณ์'][i] = "ต.ช."
    elif df['เครื่องราชอิสริยาภรณ์'][i] == 'ตริตาภรณ์ช้างเผือก':
      df['เครื่องราชอิสริยาภรณ์'][i] = "ต.ม."
    elif df['เครื่องราชอิสริยาภรณ์'][i] == 'ตริตาภรณ์มงกุฏไทย':
      df['เครื่องราชอิสริยาภรณ์'][i] = "จ.ช."
    elif df['เครื่องราชอิสริยาภรณ์'][i] == 'จัตุรถาภรณ์ช้างเผือก':
      df['เครื่องราชอิสริยาภรณ์'][i] = "จ.ม."
    elif df['เครื่องราชอิสริยาภรณ์'][i] == 'จัตุรถาภรณ์มงกุฎไทย':
      df['เครื่องราชอิสริยาภรณ์'][i] = "บ.ช."
    elif df['เครื่องราชอิสริยาภรณ์'][i] == 'เบญจมาภรณ์ช้างเผือก':
      df['เครื่องราชอิสริยาภรณ์'][i] = "บ.ม."
    else:
      df['เครื่องราชอิสริยาภรณ์'][i] = ""

  for j in range(len(df['ตำแหน่ง'])):
    if df['ตำแหน่ง'][j] == 'แม่บ้าน':
      df['รหัสตำแหน่ง'][j] = "1104"
    elif df['ตำแหน่ง'][j] == 'พนักงานธุรการ':
      df['รหัสตำแหน่ง'][j] = "2108"
    elif df['ตำแหน่ง'][j] == 'พนักงานพิมพ์':
      df['รหัสตำแหน่ง'][j] = "2113"
    elif df['ตำแหน่ง'][j] == 'พนักงานห้องสมุด':
      df['รหัสตำแหน่ง'][j] = "2210"
    elif df['ตำแหน่ง'][j] == 'พนักงานสื่อสาร':
      df['รหัสตำแหน่ง'][j] = "2301"
    elif df['ตำแหน่ง'][j] == 'พนักงานวิทยุ':
      df['รหัสตำแหน่ง'][j] = "2302"
    elif df['ตำแหน่ง'][j] == 'พนักงานการเกษตร':
      df['รหัสตำแหน่ง'][j] = "2505"
    elif df['ตำแหน่ง'][j] == 'พนักงานผลิตทดลอง':
      df['รหัสตำแหน่ง'][j] = "2509"
    elif df['ตำแหน่ง'][j] == 'พนักงานห้องปฏิบัติการ':
      df['รหัสตำแหน่ง'][j] = "2511"
    elif df['ตำแหน่ง'][j] == 'พนักงานขับรถยนต์':
      df['รหัสตำแหน่ง'][j] = "2913"
    elif df['ตำแหน่ง'][j] == 'ช่างไฟฟ้า':
      df['รหัสตำแหน่ง'][j] = "3201"
    elif df['ตำแหน่ง'][j] == 'ช่างฝีมือสนาม':
      df['รหัสตำแหน่ง'][j] = "3307"
    elif df['ตำแหน่ง'][j] == 'ช่างซ่อมบำรุง':
      df['รหัสตำแหน่ง'][j] = "3333"
    elif df['ตำแหน่ง'][j] == 'พนักงานขับเครื่องจักรกลขนาดกลาง':
      df['รหัสตำแหน่ง'][j] = "3503"
    else:
      df['รหัสตำแหน่ง'][j] = ""

  for k in range(len(df['วันบรรจุ'])):
      df['บ.ม.'][k] = str(df['วันบรรจุ'][k].year +BE+5)
      df['บ.ช.'][k] = str(df['วันบรรจุ'][k].year +BE+10)
      df['จ.ม.'][k] = str(df['วันบรรจุ'][k].year +BE+15)
      df['จ.ช.'][k] = str(df['วันบรรจุ'][k].year +BE+20)

  conFile = fileName+'(Convert).xlsx'

  df.to_excel(conFile)
  return conFile